In [1]:
import pandas as pd
import numpy as np

In [2]:
np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [3]:
df =pd.DataFrame(data = np.arange(0,20).reshape(5,4),index = ["Row1","Row2","Row3","Row4","Row5"],columns = ["column1","column2","column3","column4"])

In [4]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.info

<bound method DataFrame.info of       column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19>

In [7]:
df.describe()

         column1    column2    column3    column4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [8]:
##Indexing
## columnname,rowindex[loc],rowindex columnindex number[.iloc]
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [9]:
df.loc["Row3"]

column1     8
column2     9
column3    10
column4    11
Name: Row3, dtype: int32

In [10]:
type(df.loc["Row3"])

pandas.core.series.Series

In [11]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [12]:
# indexing

df.iloc[2:4,0:2]

      column1  column2
Row3        8        9
Row4       12       13

In [13]:
df.iloc[:,1:]

      column2  column3  column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [14]:
# to convert dataframe into arrays

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

# basic operations

In [15]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [20]:
df

      Column1  Column2  Column3
Row1        1      NaN        2
Row2        1      3.0        4

In [22]:
df['Column3'].value_counts()

2    1
4    1
Name: Column3, dtype: int64

In [24]:
df[df["Column2"]>2]

      Column1  Column2  Column3
Row2        1      3.0        4